import React from 'react';
import './MainShrine.css';

import sulUvays from '../../../Assets/Images/Qoraqalpoq/Obidalar/sul-uvays.jpg';

function MainShrine() {
	return (
		<>
			<section className="main-shrine">
				<div className="container">
					<div className="main-shrine-info">
						<h2 className="main-shrine-heading">
							Султон Увайс Қараний зиёратгоҳи
						</h2>

						<img
							src={sulUvays}
							alt="obj info-img"
							className="img-obj"
							width={700}
							height={400}
						/>

						<h3 className="tema">
							Тасаввуф таълимоти тарихига бағишланган тазкираларда
							«Икки жаҳон қуёши», «Яман Юлдузи» деб аталувчи буюк
							зот Суҳайл ибн Омир Увайс Қаранийдир.
						</h3>
						<p className="obj-paragraph">
							Суҳайл 1/621 йилида Яман вилоятига қарашли Қаран
							қабиласининг сарбони Мурод ибн Амир оиласида
							туғилган. Гўдаклигидан отасидан айрилиб онаси билан
							қолган. Суҳайл «худрўй» - туғма руҳий иқтидор соҳиби
							бўлган. «Увайс» дейишларининг сабаби у ҳеч бир ҳожат
							ва воситасиз Пайғамбаримиз (с.а.в.) руҳидан тарбия
							топган. Етти ёшга келганида «Мақоми той» – хоҳлаган
							жойда бўлиш. «Кашшофул қулуб» – Одамнинг қалбидаги
							ниятини ўқиш. «Кашифул қубур» – Қабрдаги марҳум
							ҳолин ёнидан ўтганда айта олиш кобилятига эга
							бўлган. Мана шу ҳислатлар эгаси Увайс Қараний
							туфайли ўз элини ташлаб кетишга мажбур бўлади. Онаси
							билан Амударёнинг пастки томони – Қаратау этакларига
							келиб, чўпонлардан паноҳ топади ва Юзбой исмли бойга
							чўпонлик қилади. Пайғамбаримиз (с.а.в.)нинг дин
							йўлида олиб борган курашларида қатнашган. Лекин
							Пайғамбаримиз (с.а.в.) билан кўришиш ул кишига насиб
							бўлмаган, тушларига кириб хақиқат йўлига даъват
							қилган. Афсоналарда айтилишича Муҳаммад (с.а.в.)
							вафотларидан олдин қимматбаҳо тўнларини мерос
							қолдирганлар. Эгасига топширишни Ҳазрати Умар (р.а.)
							ва Али (р.а.) амалга оширганлар. 656 йили Ҳазрати
							Али Ислом йўлида Форс юртига юриш қилади. Сиффин
							жанги бўлиб унга бутун мусулмон қабилалари ва шу
							қаторда Султон Увайс ҳам қатнашади ва ҳижрий 37 (656
							йили) шаввол ойининг 17-куни Сиффин жангида шаҳид
							бўлади. Оллоҳ йўлида ўзидан, ўзлигидан кечган
							кароматли тобутини олиш учун етти қабила ўртасида
							тортишув бўлган. Шунда Ҳазрати Али (р.а.) бу
							муаммони ҳал қилиш мақсадида бир кун муҳлат сўрайди.
							Эрталаб қабила вакилларига етти тобут ясашини
							буюради. Мўжиза рўй бериб етти тобутда ҳам Увайс
							Қараний бирдай кўринган. Аммо афсоналарга қараганда
							хақиқий жасад Хоразм вакилари тобутида бўлган ва уни
							ўзи яшаган Султан Увайс тоғига дафн қилишган
							дейишади. Қорақалпоғистон Республикаси Беруний
							туманидаги Султон Увайснинг рамзий қабри жойлашган.
							Мусулмон мамлакатларидан Шомнинг Суфа кентида,
							Суриянинг Сибон, Раққа шаҳрида, Туркияда,
							Озарбайжонда, Ўзбекистонинг икки гўшаси Наманган ва
							Қорақалпоғистоннинг Беруний туманида зиёратгоҳлари
							мавжуд. Қадимда уламоларнинг қабрлари етти жойга
							қўйилган. Қайси даврда бунёд бўлганлигини аниқ айтиш
							қийин, лекин Султон Муҳаммад Хоразмшоҳ томонидан 998
							йили биринчи маротаба мақбара тикланган. Чингизхон
							босқинчилигидан сўнг Амир Темур томонидан қайта
							тикланган. 1805–1806 йилларда Хива хони Елтезер
							томонидан таъмирланган. 1836 1838-йили Оллокулихон
							тарафидан ҳам чиройли мақбара бунёд бўлган. Хон бу
							мақбарани қурдиришдан олдин халқни чақириб, катта
							сайил уюштиради. Султон Увайс бобога кетишда
							«Чилпиқ» тепалиги бор. Бу аслида «Чилиу (ф) – Кирик
							сурнайчи» бўлиб сайил пайтида бу тепаликда сурнай ва
							карнайлар чалиниб, халқни сайил ва ҳашарга чорлаган.
							Ул кишининг муқаддас қабрлари пастги қисмида ховуз
							жойлашган. Икки км узоқликда «Аллоҳга муножат этган
							жой», «Муножот» тепалиги бор. Афсоналарга қараганда
							Султон Увайс Қараний Қаратау этакларида чўпонлик
							қилган. Кунларнинг бирида Амударё тошиб у яшаётган
							қишлоқни сув олиш хавфини сезиб қолади. Бобомиз бу
							ҳолатдан элнинг жабр чекишидан, бегуноҳ одамлар ўлиб
							кетишининг олдини олиш мақсадида Қара таунинг энг
							баланд чўққисига чиқиб тонггача Оллоҳдан элни сув
							босмаслигини илтижо қилади ва мўъжиза рўй бериб,
							оқиб келаётган сув қишлоқнинг устидан иккига бўлиниб
							айланиб ўтиб кетади. Ҳозирда бу тепалик «Муножот»
							тепалиги деб аталади ва бу ерда бобомизнинг тирсак
							ва оёқ излари тошга ўйилган ҳолатда муҳрланиб
							қолган. Зиёратгоҳ 1980 йили қайта реконстуркция
							қилиш бошланиб ва 1991 йилда тугатилган. Маҳаллий
							аҳолидан ташқари бу ерга кўплаб қўшни юртлардан ҳам
							зиёратчилар ташриф буюришади.
						</p>
						<h3 className="tema">Ривоят</h3>
						<p className="obj-paragraph">
							Рабих Ҳошим Увайс Қаранийни кўриш учун борди. Увайс
							ибодат билан машғул бўлганлиги учун кутиб ўтирди ва
							кўнглидан ўтказди. - Увайс менга ҳам бир ўгит берса
							эди. Увайс Қараний дуога қўл очиб дебди: - Аллоҳим,
							кўп ухлар кўздан ва кўп еяр қориндан Ўзингдан паноҳ
							тилайман. Бу сўзларни эшитган Рабих Ҳошим «менга шу
							ўгит етарли» деб уйига қайтди. Султон Вайс Қараний
							тарихда ўзига яраша ўрни бор буюк шахсдир.
						</p>
					</div>
				</div>
			</section>
		</>
	);
}

export default MainShrine;
